# Задание 1.6.M

x = int(input('Введите x: '))
y = int(input('Введите y: '))

print((x > 0) and (y > 0))