# Задание 1.5.F

x = int(input('Введите значение x: '))

if (2 <= x <= 5) or (-1 <= x <= 1):
    print('x принадлежит одному из промежутков')
else:
    print('x не принадлежит промежуткам')